# [выражение for переменная in коллекция] так строятся генераторы шаблонов
a = [0 for i in range(7)]  # например вывод [0, 0, 0, 0, 0, 0, 0]
a = [i for i in range(7)]  # вывод [0, 1, 2, 3, 4, 5, 6] поскольку i принимала значения от 0 до 6ти
a = [i ** 2 for i in range(7)]  # вывод [0, 1, 4, 9, 16, 25, 36] поскольку i принимала значения от 0 до 6ти
a = [i ** 2 for i in range(2, 7)]  # вывод [4, 9, 16, 25, 36] поскольку i принимала значения от 2 до 6ти
a = [i for i in 'hello']  # вывод ['h', 'e', 'l', 'l', 'o'] поскольку i принимала значения от h до o
a = [i * 2 for i in 'hello']  # вывод ['hh', 'ee', 'll', 'll', 'oo'] поскольку i принимала значения от h до o
a = [ord(i) for i in 'abcd']  # вывод [97, 98, 99, 100] поскольку i принимала значения кода от a до d
import random  # импорт случайного числа

a = [random.randint(-10, 10) for i in range(5)]  # [6, -7, 4, 2, 6] вывод(случ.число от -10 до 10 запись 5 раз)
b = [abs(i) for i in a]  # [6, 7, 4, 2, 6] запишет в b сделав с отриц.в полож.
b = [i * 2 for i in b]  # [12, 14, 8, 4, 12] запишет в b умножив предуидущий список на 2
# [выражение for переменная in коллекция if условие] так строятся генераторы шаблонов с условием
b = [i for i in a if i % 2 == 0]  # запишет в b все элементы с a которые чётные [6, 4, 2, 6]

a = input().split()  # введёт сначала элементы и запишет как буквы через пробел (.split()) ['2', '3', '6', '7']
a = [int(i) for i in a]  # преобразует буквы в числа [2, 3, 6, 7]

n = 5  # например строки
m = 3  # например столбцы
a = [[0] * m for i in range(n)]  # заполнил список 0*m n раз [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]]
a[1][2] = 5  # изменит только 1 эелемент [[0, 0, 0], [0, 0, 5], [0, 0, 0], [0, 0, 0], [0, 0, 0]]

a = [(i, j) for i in 'ab' for j in [1, 2]]  # [('a', 1), ('a', 2), ('b', 1), ('b', 2)]
# видим что соединялось a с 1 потом с 2 и b с 1 потом с 2 (для i и j)
a = [i * j for i in [1, 3, 5] for j in [3, 7, 8] if i * j > 10]  # [21, 24, 15, 35, 40]
# запись в а элементов которые при i*j были больше 10 (1*3,1*7,1*8, 3*3,{<10} 3*7,3*8 и т.д.)
print(a)
