"""
    Напишите программу для печати "Python это круто!" строка с использованием переменной/s."""
s = "Python это круто!"
print(s)

"""
    Напишите программу, которая складывает два числа, для чисел используйте переменные, 
    и печатайте результат."""
x = 5
y = 6
print(x + y)

"""
    Напишите программу, которая вычитает два числа, для чисел используйте переменные 
    и печатает результаты."""
x = 5
y = 6
print(x - y)

"""
    Напишите программу, которая печатает тип переменной."""
x = "Hello"
print(type(x))
